Revit 2024 API
BuiltInFailures.TrussFailures.InvalidWorkplaneForStructuralFraming Property
 Workplane not valid for Structural Framing component "[Family Name]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidWorkplaneForStructuralFraming { get; }
Visual Basic
Public Shared ReadOnly Property InvalidWorkplaneForStructuralFraming As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidWorkplaneForStructuralFraming {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace